// import './GroupList.css'

export default function GroupList() {
  const students = [
    "Аптракова А.А.",
    "Белов А.Е.",
    "Белоногов В.А.",
    "Беляевских А.В.",
    "Ведерников М.В.",
    "Гилев А.А.",
    "Казаков Н.С.",
    "Кетова А.А.",
    "Кискичева К.М.",
    "Кобжасаров Д.М.",
    "Лежнев А.К.",
    "Луца Д.А.",
    "Мамонтов С.И.",
    "Машанов Д.С.",
    "Мельников И.Н.",
    "Пономарев И.К.",
    "Султангулов Д.Р.",
    "Трошков Д.С.",
    "Туров М.А.",
    "Федорочев А.А.",
    "Шурманов Д.А."
  ]

  return (
    <div className="group-list">
      <h2>Список группы</h2>
      <ol>
        {students.map((student, index) => (
          <li key={index} style={{ marginBottom: '0.5rem' }}>
            {student}
          </li>
        ))}
      </ol>
    </div>
  )
}
